app/views/gossip/index.html.erb

    <% if logged_in? %>
      <%= User.find_by(id: session[:user_id]).first_name %> !
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

        <h5 class="card-title"><%= elem.title %></h5>
        <p class="card-text"><small class="text-muted">Posted by <%= link_to elem.user.first_name, user_path(elem.user) %></small></p>
        <%= link_to "Read more", gossip_path(elem), class: "btn btn-dark" %>
        Commentaires : <%=elem.comments.count%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 40]]