app/views/gossip/show.html.erb


<p>Auteur du Potin : <%= link_to @current_gossip.user.first_name, user_path(@current_gossip.user.id), :class => "nav-link"%> </p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]


Commentaires (<%=@current_gossip.comments.count%>) :
<div class="container text-center">
    <%@current_gossip.comments.each do |elem|%>
        <p><strong> <%= elem.user.first_name%></strong> :
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 37]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 37]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]