app/views/city/show.html.erb

SELECT "gossips".* FROM "gossips" INNER JOIN "users" ON "gossips"."user_id" = "users"."id" WHERE "users"."city_id" = $1  [["city_id", 3]]
---
<div class="row">
<%@current_city.gossips.each do |elem|%>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
          <h5 class="card-title"><%= elem.title %></h5>
          <p class="card-text"><small class="text-muted">Posted by <%= link_to elem.user.first_name, user_path(elem.user) %></small></p>