app/helpers/session_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
    def current_user
        User.find_by(id: session[:user_id])