app/controllers/city_controller.rb

SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
      @current_city = City.find(params[:id].to_i)