app/controllers/comment_controller.rb

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "gossip_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "test"], ["gossip_id", 37], ["created_at", "2023-05-11 01:25:59.704877"], ["updated_at", "2023-05-11 01:25:59.704877"], ["user_id", 16]]
---
  def create
    @current_gossip = Gossip.find(params[:gossip_id].to_i)
    @comment = Comment.new(
      'user_id' => User.all.sample.id,
      'gossip_id' => @current_gossip.id,
      'content' => params[:content]
    )
    puts params
    if @comment.save

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["gossip_id", 37], ["id", 34], ["LIMIT", 1]]
---
  def edit
    @current_gossip = Gossip.find(params[:gossip_id].to_i)
    @current_comment = @current_gossip.comments.find(params[:id].to_i)

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["gossip_id", 37], ["id", 34], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "test"], ["updated_at", "2023-05-11 01:31:13.160790"], ["id", 34]]
---
  def update
    @current_gossip = Gossip.find(params[:gossip_id].to_i)
    @current_comment = @current_gossip.comments.find(params[:id].to_i)
    comment_params = params.permit(:content)
    if @current_comment.update(comment_params)

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["gossip_id", 37], ["id", 34], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 34]]
---
  def destroy
    @current_gossip = Gossip.find(params[:gossip_id].to_i)
    @current_comment = @current_gossip.comments.find(params[:id].to_i)
    if @current_comment.destroy