app/controllers/gossip_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @all_gossips = Gossip.all

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["content", "on va voir"], ["user_id", 32], ["created_at", "2023-05-11 09:22:21.926953"], ["updated_at", "2023-05-11 09:22:21.926953"]]
---
  def create
    @gossip = Gossip.new('user_id' => User.all.sample.id,
                   'title' => params[:title],
                   'content' => params[:content])
    @gossip.user = User.find_by(id: session[:user_id])
    if @gossip.save

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @gossip = Gossip.find(params[:id].to_i)

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @current_gossip = Gossip.find(params[:id].to_i)

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "user_id" = $3, "updated_at" = $4 WHERE "gossips"."id" = $5  [["title", "EDITER"], ["content", "UNE EDITION"], ["user_id", 6], ["updated_at", "2023-05-10 06:25:00.266945"], ["id", 7]]
---
  def update
      @gossip = Gossip.find(params[:id])
      if @gossip.update('user_id' => User.all.sample.id,'title' => params[:title],'content' => params[:content])

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 2]]
---
  def destroy
    @gossip = Gossip.find(params[:id])
    @gossip.destroy