app/controllers/user_controller.rb

SELECT "users".* FROM "users"
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(
                   'first_name' => params[:first_name],
                   'last_name' => params[:last_name],
                   'email' => params[:email],
                   'password' => params[:password],
                   'city_id' =>  User.all.sample.id
                   )
                   if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def show
    @current_user = User.find(params[:id].to_i)